                        Aula 2: Preparação e limpeza dos dados

Como pr

In [1]:
import funcoes

In [2]:
base_de_dados = funcoes.carregar_dados()

In [3]:
base_de_dados.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte

In [4]:
base_de_dados.isnull().sum()

ano                10
senioridade         0
Contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

In [5]:
base_de_dados['ano'].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [6]:
base_de_dados['ano'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
133344    False
133345    False
133346    False
133347    False
133348    False
Name: ano, Length: 133349, dtype: bool

In [7]:
import pandas as pd

import numpy as np

dataframe_salarios = pd.DataFrame({
                                   
                                   'nome': ["Ana", "Bruno", "Carlos","Daniele", "val"],
                                   
                                   "salario":[4000, np.nan, 5000, np.nan, 100000]
                                   
                                   })

dataframe_salarios['salario_media'] = dataframe_salarios['salario'].fillna(dataframe_salarios["salario"].mean().round(2))

In [8]:
dataframe_salarios

      nome   salario  salario_media
0      Ana    4000.0        4000.00
1    Bruno       NaN       36333.33
2   Carlos    5000.0        5000.00
3  Daniele       NaN       36333.33
4      val  100000.0      100000.00

In [9]:
dataframe_salarios['salario_mediana'] = dataframe_salarios['salario'].fillna(dataframe_salarios['salario'].median().round(2))

In [10]:
dataframe_salarios

      nome   salario  salario_media  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      val  100000.0      100000.00         100000.0

In [11]:
dataframe_temperatura = pd.DataFrame({
                    
                      'dia_semana': ["Segunda", "Terça", "Quarta", "Quinta", "Sexta"],
    
                       'temperatura': [30, np.nan, np.nan, 28, 27]
})

dataframe_temperatura['preenchido_ffill'] = dataframe_temperatura['temperatura'].ffill()

dataframe_temperatura

  dia_semana  temperatura  preenchido_ffill
0    Segunda         30.0              30.0
1      Terça          NaN              30.0
2     Quarta          NaN              30.0
3     Quinta         28.0              28.0
4      Sexta         27.0              27.0

In [12]:
dataframe_temperatura['preenchido_bfill'] = dataframe_temperatura['temperatura'].bfill()

dataframe_temperatura

  dia_semana  temperatura  preenchido_ffill  preenchido_bfill
0    Segunda         30.0              30.0              30.0
1      Terça          NaN              30.0              28.0
2     Quarta          NaN              30.0              28.0
3     Quinta         28.0              28.0              28.0
4      Sexta         27.0              27.0              27.0

In [13]:
dataframe_cidades = pd.DataFrame({
    
    'nome':["Ana", "Bruno", "Carlos", "Daniele", "val"],
    
    'cidades':["São Paulo", np.nan, "Curitiba", np.nan, "Belem", ]
    
})

dataframe_cidades['cidade_preenchida'] = dataframe_cidades['cidades'].fillna("Cidade não informada")

dataframe_cidades

      nome    cidades     cidade_preenchida
0      Ana  São Paulo             São Paulo
1    Bruno        NaN  Cidade não informada
2   Carlos   Curitiba              Curitiba
3  Daniele        NaN  Cidade não informada
4      val      Belem                 Belem

In [14]:
base_de_dados_limpa = base_de_dados.dropna()

In [15]:
base_de_dados_limpa.isnull().sum()

ano                0
senioridade        0
Contrato           0
cargo              0
salario            0
moeda              0
usd                0
residencia         0
remoto             0
empresa            0
tamanho_empresa    0
dtype: int64

In [16]:
base_de_dados_limpa.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte

In [17]:
base_de_dados_limpa.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  float64
 1   senioridade      133339 non-null  object
 2   Contrato         133339 non-null  object
 3   cargo            133339 non-null  object
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  object
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  object
 8   remoto           133339 non-null  object
 9   empresa          133339 non-null  object
 10  tamanho_empresa  133339 non-null  object
dtypes: float64(1), int64(2), object(8)
memory usage: 12.2+ MB

In [18]:
base_de_dados_limpa = base_de_dados_limpa.assign(ano = base_de_dados_limpa['ano'].astype(int))

In [19]:
base_de_dados_limpa.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  int64
 1   senioridade      133339 non-null  object
 2   Contrato         133339 non-null  object
 3   cargo            133339 non-null  object
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  object
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  object
 8   remoto           133339 non-null  object
 9   empresa          133339 non-null  object
 10  tamanho_empresa  133339 non-null  object
dtypes: int64(3), object(8)
memory usage: 12.2+ MB

In [20]:
base_de_dados_limpa.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte